Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 176, 208, 16)      448       
_________________________________________________________________
batch_normalization (BatchNo (None, 176, 208, 16)      64        
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 88, 104, 16)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 88, 104, 32)       4640      
_________________________________________________________________
batch_normalization_1 (Batch (None, 88, 104, 32)       128       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 44, 52, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 44, 52, 64)        18496     
_________________________________________________________________
batch_normalization_2 (Batch (None, 44, 52, 64)        256       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 22, 26, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 22, 26, 128)       73856     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 11, 13, 128)       0         
_________________________________________________________________
flatten (Flatten)            (None, 18304)             0         
_________________________________________________________________
dense (Dense)                (None, 32)                585760    
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 132       
_________________________________________________________________
activation (Activation)      (None, 4)                 0         
=================================================================
Total params: 683,780
Trainable params: 683,556
Non-trainable params: 224
_________________________________________________________________
